In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(randn(6),index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [3]:
ser

1  a   -0.022997
   b   -0.920625
   c   -0.283760
2  a    0.280623
   b   -1.151977
   c    0.804309
dtype: float64

In [4]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [5]:
ser[1]

a   -0.022997
b   -0.920625
c   -0.283760
dtype: float64

In [6]:
ser[2]

a    0.280623
b   -1.151977
c    0.804309
dtype: float64

In [7]:
ser[:,'a']

1   -0.022997
2    0.280623
dtype: float64

In [10]:
dframe = ser.unstack() #outer index becomes the rows inner index becomes the columns

In [11]:
dframe

          a         b         c
1 -0.022997 -0.920625 -0.283760
2  0.280623 -1.151977  0.804309

In [12]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [13]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [14]:
dframe2.index.names = ['INDEX_1','INDEX_2']

dframe2.columns.names = ['Cities','Temp']

dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [16]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [20]:
dframe2.sort_index(level=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [21]:
dframe2.sum(level='Temp',axis=1)

/var/folders/_7/178775hs6nz5h81l3b_pbb8h0000gn/T/ipykernel_86418/419258034.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27